### Import

In [1]:
import pandas as pd
import numpy as np 

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [6]:
n_rows = 365 * 24
n_cols = 2
cols = ['col1','col2']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),
                 columns=cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df

                     col1  col2
2000-01-01 00:00:00     3    15
2000-01-01 01:00:00    14    12
2000-01-01 02:00:00     5     5
2000-01-01 03:00:00    13    11
2000-01-01 04:00:00    19    13
...                   ...   ...
2000-12-30 19:00:00    15    13
2000-12-30 20:00:00    16     9
2000-12-30 21:00:00     3    14
2000-12-30 22:00:00    12     4
2000-12-30 23:00:00    12     6

[8760 rows x 2 columns]

In [4]:
## pd.util.testing.makeDateIndex --> deret waktu 
## freq='H' --> intervalnya per jam

### Resampling data dengan interval monthly

In [7]:
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7652
2000-02-29  6754
2000-03-31  7598
2000-04-30  7070
2000-05-31  7776
2000-06-30  7356
2000-07-31  7426
2000-08-31  7498
2000-09-30  7175
2000-10-31  7305
2000-11-30  7070
2000-12-31  7140

In [8]:
### nilai yang di col 1 adalah nilai agregasi

### Resampling data dengan interval daily

In [10]:
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   258
2000-01-02   212
2000-01-03   224
2000-01-04   265
2000-01-05   247
...          ...
2000-12-26   226
2000-12-27   271
2000-12-28   251
2000-12-29   208
2000-12-30   247

[365 rows x 1 columns]